<?xml version="1.0"?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data shape="1,224,224,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,inputs,inputs:0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inputs/Transpose([0 3 1 2])/value1306118039" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="inputs/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="32" size="3456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/Conv1_1/convolution/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/Conv1_1/convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3488" size="128" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/bn_Conv1_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/Conv1_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/Conv1_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3616" size="1152" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4768" size="128" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_depthwise_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="4896" size="2048" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_1/convolution/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="6944" size="64" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/expanded_conv_project_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="7008" size="6144" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_1/convolution/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="13152" size="384" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_expand_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="13536" size="3456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="16992" size="384" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_depthwise_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="17376" size="9216" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_1/convolution/ReadVariableOp:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="26592" size="96" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_1_project_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="26688" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_1/convolution/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="40512" size="576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_expand_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="41088" size="5184" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="46272" size="576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_depthwise_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="46848" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_1/convolution/ReadVariableOp:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="60672" size="96" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_project_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_add_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_2_add_1/Add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="60768" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_1/convolution/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="74592" size="576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_expand_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="75168" size="5184" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="80352" size="576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_depthwise_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="80928" size="18432" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_1/convolution/ReadVariableOp:0">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="99360" size="128" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_3_project_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="99488" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_1/convolution/ReadVariableOp:0">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="124064" size="768" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_expand_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="124832" size="6912" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="131744" size="768" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_depthwise_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="132512" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_1/convolution/ReadVariableOp:0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="157088" size="128" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_project_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_add_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_4_add_1/Add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="157216" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_1/convolution/ReadVariableOp:0">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="181792" size="768" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/sub:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_BN_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_relu_1/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_expand_relu_1/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_depthwise_BN_1/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="182560" size="6912" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_depthwise_1/depthwise/ReadVariableOp:0">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/sequential_1/mobilenetv2_1.00_224_1/block_5_depthwise_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
